{
    "title": "==21.17.1a(a5.2)==\nPoly-Thematic\n==MonoSpace==",
    "body": "After a few weeks, we're back here again. This time, the update is actually minor in terms of the outsides, but the insides... they are completely changed. (Read this all because there's a lot of cool stuff)\n\n==UI Updates==\n-Dark theme, Red theme, Blue theme for the Main Menu\nYep, theming is now a part of the main menu as well! The feature is still pretty work in progress so don't expect it to be fully functional. You can set the theme via Settings > Advanced Settings > Appearance > Main Menu Theme.\n\n-Localization\nYes, localization in monospace is a thing! (again). There's only localization for the Main Menu at the moment, it includes: Italian, French and Danish translations.\n\n-Remade every panel in the main menu\nWe (as in I, Nextin) have remade all panels in the main menu to be consistent, and to support localization.\n\n-Remade every *animation* in the main menu\n...since it was necessary.\n\n-Quit prompt\nAdded a quit prompt to the main menu, just to be sure you actually want to leave.\n\n-Updated credits for localization\n\n==Gameplay Updates==\n-Sandbox Mode\nWe couldn't finish fast mode in time, but we did add a very early version of the sandbox mode! It's not fully finished but you can import, export, and play custom levels.\n\n-MonoChromatic's new song\nSuisoldier made a new track just for Mono-Chromatic, eventually there'll be a new track for the main menu as well.\n\n-Multiple Save files\nThanks to \"d2dyno\", we were able to make a completely new save system that supports multiple saves!\nBut... unfortunately, all of your old saves will not work anymore. The game will bug out if it sees old saves, so delete them.\n\n==Optimization==\n-Quality Modes\nSince monospace didn't run that well, even on my computer, I decided to add graphics settings. They don't do a whole lot but they do reduce GPU usage.\n\n-FPS Limiter\nNow there'll be a limit to how many FPS you want. The default is set to 60 but you can change it in the settings.\n\n-Optimized Scripts\n-Optimized Render Pipeline\n\n==Code Updates==\n-Completely new Settings system!\nAlso thanks to d2dyno, there's a new settings system. It saves to your documents.\n-Asynchronous Load for the loading scene\n-Added Json.NET support\n\n==Bug Fixes==\n-Fixed tophat being stuck on\n-Fixed rebinds menu not applying rebinds, doesn't fully work yet though\n-\"Fixed\" the preview tab for Mono not working\n",
  "timestamp": "May 1st 2021",
  "version": "5.2"

}
