{
    "title": "==21.13.1a(a5.1)==\nImprovements\n==MonoSpace==",
    "body": "Hey there! Welcome back to MonoSpace!\nThis changelog is a bit different compared to the rest, why? Because it's over the internet! I didn't write this in the game, I wrote this in a JSON file on our new website! (Coming soon)\nAnyway, let's get right into the changes, just like the last update, it'll be the biggest features first!\n\n-Overhauled World Map\nNow the world map uses a new script to manage worlds! It behaves exactly like before except that it's more reliable *and* it's easier to set up. You now have to enter doors by pressing \"W\".\n\n-Reverted very old change of tile hitboxes\nBack in november/december, I had made every tile a square hitbox, because everything seemed to go through them. But, I checked again, and it doesn't happen anymore, so, now every tile has an appropriate hitbox again!\n\n\n==Gameplay Changes==\n-Completely new finish line\nNow the finish line isn't a flag anymore, but it's a teleporter! (somewhat)\nIt behaves the same, except that now if you get inside the finish line, it'll freeze you in the air.\n\n-Overhauled Mono\nWe've found a new way to implement the old suggestions of having arm movements for stuff like placing objects/using bows and crossbows, and because of that we had to remake every animation of mono, and while we were at it, we also made him 1.3x larger.\n\n-Mono Customization\nYou can now customize Mono! (somewhat). You can assign him different \"hairstyles\" and you can give him a hat! For now, the only options that are available are from NPCs, so: WR, Nuvi, and the Guardian, and for the hats you now have a small top hat! (It's in Settings > Advanced Options > Appearance)\n\n==NPCs and Dialogue==\n\n-NPC Expression Animation\nNow NPCs(WR) will have animations based on the expressions! (Example: if the expression in the dialogue box is smiling, WR will smile in game)\n\n-You cannot skip dialogue (TEMPORARY)\nFor now, you cannot skip the dialogue if it's not finished typing, this is a temporary feature until we implement a \"fast forward\" button of sorts.\n\n-Punctuation\nPunctuation in the dialogue won't trigger the sound effect anymore, periods and commas now take longer to write.\n\n==GUI and UX==\n-New Finish Panel\nWe're working on a new design for the finish panel, for now it's more or less the same.\n\n-New Loading Animation while booting up the game\nIn the last update, we introduced a loading bar at the bottom of the screen in the boot process. Now instead of being an ugly bar, it's a rounded hexagon. (This'll be used throughout the game eventually).\n\n==Bug Fixes==\nFixed \"Discord Rich Presence\" not showing up at all or appearing broken\nFixed resolution dropdown not setting the resolution\nFixed fullscreen toggle from being stuck on at boot (it was only a graphics issue)\n\n\n==Known Issues==\nRhombus enemy might not work like before, due to the tile hitbox change, we've had to remake the logic for them a bit, it might not flip.\nThere might be reduced performance while playing levels, we're looking for a fix.\n\n\n==Conclusion==\n\nThis update was way bigger than what it was meant to be! We made a lot of new exciting changes to the game that make it feel better, and cooler!\n\nWe have to talk a bit about N7 | Monoteam as a whole, because soon enough we will have our very own launcher! It'll update the game, and also display updates, and it will also allow you to launch MonoSpace, or any other project that we're working on!\n\n\nThank you for reading this, and have fun!"",
  "timestamp": "April 3rd 2021",
  "version": "5.1"

}
